benchmarks/results/auth-serialization/test-me/baseline/sar-metrics/wrk2/wrk_report.txt
Running 30s test @ http://127.0.0.1:8000/api/v1/access/me
  2 threads and 4 connections
  Thread calibration: mean lat.: 5.023ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 7.073ms, rate sampling interval: 13ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.49ms    5.16ms  66.69ms   98.22%
    Req/Sec   311.42     46.83   500.00     67.19%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.99ms
 75.000%    6.01ms
 90.000%    6.54ms
 99.000%   35.20ms
 99.900%   64.29ms
 99.990%   66.50ms
 99.999%   66.75ms
100.000%   66.75ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.443     0.000000            1         1.00
       3.031     0.100000         1200         1.11
       3.407     0.200000         2405         1.25
       4.247     0.300000         3606         1.43
       4.647     0.400000         4810         1.67
       4.995     0.500000         5998         2.00
       5.335     0.550000         6604         2.22
       5.535     0.600000         7198         2.50
       5.691     0.650000         7807         2.86
       5.859     0.700000         8403         3.33
       6.015     0.750000         9007         4.00
       6.091     0.775000         9302         4.44
       6.171     0.800000         9610         5.00
       6.247     0.825000         9899         5.71
       6.335     0.850000        10202         6.67
       6.435     0.875000        10496         8.00
       6.487     0.887500        10655         8.89
       6.543     0.900000        10803        10.00
       6.603     0.912500        10951        11.43
       6.675     0.925000        11102        13.33
       6.755     0.937500        11251        16.00
       6.795     0.943750        11329        17.78
       6.843     0.950000        11407        20.00
       6.895     0.956250        11471        22.86
       6.963     0.962500        11547        26.67
       7.067     0.968750        11622        32.00
       7.151     0.971875        11659        35.56
       7.259     0.975000        11697        40.00
       7.387     0.978125        11733        45.71
       8.139     0.981250        11771        53.33
      17.327     0.984375        11808        64.00
      21.359     0.985938        11827        71.11
      27.055     0.987500        11846        80.00
      31.727     0.989062        11864        91.43
      37.215     0.990625        11883       106.67
      42.303     0.992188        11902       128.00
      44.895     0.992969        11911       142.22
      47.615     0.993750        11921       160.00
      50.079     0.994531        11930       182.86
      52.479     0.995313        11939       213.33
      55.551     0.996094        11949       256.00
      56.287     0.996484        11953       284.44
      57.759     0.996875        11958       320.00
      58.559     0.997266        11963       365.71
      59.935     0.997656        11967       426.67
      61.503     0.998047        11972       512.00
      62.047     0.998242        11974       568.89
      62.847     0.998437        11977       640.00
      63.487     0.998633        11979       731.43
      63.775     0.998828        11981       853.33
      64.511     0.999023        11984      1024.00
      65.055     0.999121        11985      1137.78
      65.087     0.999219        11986      1280.00
      65.279     0.999316        11987      1462.86
      65.311     0.999414        11988      1706.67
      65.919     0.999512        11991      2048.00
      65.919     0.999561        11991      2275.56
      65.919     0.999609        11991      2560.00
      65.919     0.999658        11991      2925.71
      66.111     0.999707        11992      3413.33
      66.367     0.999756        11993      4096.00
      66.367     0.999780        11993      4551.11
      66.367     0.999805        11993      5120.00
      66.367     0.999829        11993      5851.43
      66.495     0.999854        11994      6826.67
      66.495     0.999878        11994      8192.00
      66.495     0.999890        11994      9102.22
      66.495     0.999902        11994     10240.00
      66.495     0.999915        11994     11702.86
      66.751     0.999927        11995     13653.33
      66.751     1.000000        11995          inf
#[Mean    =        5.492, StdDeviation   =        5.164]
#[Max     =       66.688, Total count    =        11995]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  18000 requests in 30.00s, 6.71MB read
Requests/sec:    599.95
Transfer/sec:    229.08KB